# Задача 43: Дана последовательность чисел. Получить список уникальных элементов заданной последовательности.
# Пример:
# [1, 2, 3, 5, 1, 5, 3, 10] => [2, 10]

lst = [1, 2, 3, 5, 1, 5, 3, 10]
st = set()
for i in lst:
    if i in st:
        st.remove(i)
    else:
        st.add(i)
print(f'input: {lst}')
print(f'output: {list(st)}')
